historic/buffered/m2.x4large_eph/mixed-25-8to16k_120Mseq.fio.out
randread-1k: (g=0): rw=randread, bs=8K-16K/8K-16K/8K-16K, ioengine=libaio, iodepth=10
seqread: (g=0): rw=read, bs=1M-1M/1M-1M/1M-1M, ioengine=libaio, iodepth=10
seqwrite: (g=0): rw=write, bs=1M-1M/1M-1M/1M-1M, ioengine=libaio, iodepth=10
fio-2.1.4
Starting 3 processes

randread-1k: (groupid=0, jobs=1): err= 0: pid=1918: Sat Mar 15 04:20:42 2014
  read : io=3077.7MB, bw=52500KB/s, iops=4865, runt= 60017msec
    slat (usec): min=4, max=1579.8K, avg=203.02, stdev=7316.35
    clat (usec): min=3, max=3232.5K, avg=1830.98, stdev=28949.50
     lat (usec): min=8, max=3491.8K, avg=2034.13, stdev=31263.93
    clat percentiles (usec):
     |  1.00th=[   63],  5.00th=[   65], 10.00th=[   66], 20.00th=[   67],
     | 30.00th=[   68], 40.00th=[   69], 50.00th=[   71], 60.00th=[   72],
     | 70.00th=[   73], 80.00th=[   75], 90.00th=[   80], 95.00th=[   87],
     | 99.00th=[53504], 99.50th=[105984], 99.90th=[240640], 99.95th=[387072],
     | 99.99th=[1630208]
    bw (KB  /s): min=   10, max=1255696, per=43.03%, avg=40019.96, stdev=193706.45
    lat (usec) : 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%, 100=96.23%
    lat (usec) : 250=1.67%, 500=0.27%, 750=0.04%, 1000=0.04%
    lat (msec) : 2=0.05%, 4=0.06%, 10=0.09%, 20=0.11%, 50=0.40%
    lat (msec) : 100=0.51%, 250=0.44%, 500=0.07%, 750=0.01%, 1000=0.01%
    lat (msec) : 2000=0.01%, >=2000=0.01%
  cpu          : usr=0.66%, sys=3.48%, ctx=1703, majf=0, minf=69
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=292038/w=0/d=0, short=r=0/w=0/d=0
seqread: (groupid=0, jobs=1): err= 0: pid=1919: Sat Mar 15 04:20:42 2014
  read : io=3073.0MB, bw=46471KB/s, iops=45, runt= 67714msec
    slat (msec): min=3, max=173, avg= 8.14, stdev= 7.80
    clat (usec): min=2, max=297919, avg=70804.77, stdev=27188.89
     lat (msec): min=5, max=306, avg=78.95, stdev=28.46
    clat percentiles (usec):
     |  1.00th=[   16],  5.00th=[59136], 10.00th=[59648], 20.00th=[60672],
     | 30.00th=[60672], 40.00th=[63744], 50.00th=[64256], 60.00th=[64768],
     | 70.00th=[67072], 80.00th=[74240], 90.00th=[93696], 95.00th=[117248],
     | 99.00th=[201728], 99.50th=[230400], 99.90th=[296960], 99.95th=[296960],
     | 99.99th=[296960]
    bw (KB  /s): min=   67, max=155337, per=100.00%, avg=115861.94, stdev=34797.81
    lat (usec) : 4=0.65%, 10=0.20%, 20=0.23%, 50=0.03%
    lat (msec) : 10=0.33%, 20=0.29%, 50=1.56%, 100=88.02%, 250=8.43%
    lat (msec) : 500=0.26%
  cpu          : usr=0.01%, sys=10.98%, ctx=600720, majf=0, minf=2590
  IO depths    : 1=1.1%, 2=0.7%, 4=1.4%, 8=96.7%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=3073/w=0/d=0, short=r=0/w=0/d=0
seqwrite: (groupid=0, jobs=1): err= 0: pid=1920: Sat Mar 15 04:20:42 2014
  write: io=3073.0MB, bw=46477KB/s, iops=45, runt= 67706msec
    slat (usec): min=523, max=173812, avg=7892.01, stdev=7961.26
    clat (usec): min=2, max=297908, avg=68961.87, stdev=30323.83
     lat (usec): min=528, max=306466, avg=76856.76, stdev=32062.45
    clat percentiles (usec):
     |  1.00th=[    3],  5.00th=[13760], 10.00th=[59136], 20.00th=[60672],
     | 30.00th=[60672], 40.00th=[63744], 50.00th=[64256], 60.00th=[64768],
     | 70.00th=[67072], 80.00th=[74240], 90.00th=[94720], 95.00th=[118272],
     | 99.00th=[201728], 99.50th=[230400], 99.90th=[296960], 99.95th=[296960],
     | 99.99th=[296960]
    bw (KB  /s): min=   67, max=155337, per=100.00%, avg=115800.13, stdev=34631.78
    lat (usec) : 4=3.77%, 10=0.26%, 20=0.26%, 1000=0.03%
    lat (msec) : 10=0.55%, 20=0.33%, 50=1.46%, 100=84.35%, 250=8.72%
    lat (msec) : 500=0.26%
  cpu          : usr=1.40%, sys=8.77%, ctx=646140, majf=0, minf=29
  IO depths    : 1=4.3%, 2=0.7%, 4=1.3%, 8=93.8%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=3073/d=0, short=r=0/w=0/d=0

Run status group 0 (all jobs):
   READ: io=6150.7MB, aggrb=93003KB/s, minb=46471KB/s, maxb=52500KB/s, mint=60017msec, maxt=67714msec
  WRITE: io=3073.0MB, aggrb=46476KB/s, minb=46476KB/s, maxb=46476KB/s, mint=67706msec, maxt=67706msec

Disk stats (read/write):
  xvdf: ios=69649/71205, merge=0/713379, ticks=273427/5896562, in_queue=6172024, util=99.22%